app/Controllers/Login.php

    public function cek_peserta()
    {
        $nis = $this->request->getPost('nis');

        // $data = $this->model2->login_pengawas($kode_pengawas);
        $data = $this->peserta_model->where(['nis' => $nis])->first();
---
SELECT *
FROM `data_peserta`
WHERE `nis` = '10240681'
 LIMIT 1